arduino/Arduino/hardware/msp430/cores/msp430/twi.c
/*
 * Function twi_releaseBus
 * Desc     releases bus control
 * Input    none
 * Output   none
 */
void twi_releaseBus(void)
{

}

void send_start()
{
#ifdef __MSP430_HAS_USI__
	USISRL = 0x00;                // Generate Start Condition...
	USICTL0 |= USIGE+USIOE;
	USICTL0 &= ~USIGE;
	USISRL = twi_slarw;
	USICNT = (USICNT & 0xE0) + 0x08;
#endif
#ifdef __MSP430_HAS_USCI__
#endif
#ifdef __MSP430_HAS_EUSCI_B0__
#endif
}

#ifdef __MSP430_HAS_USI__

/* Work around for USI I2C slave no interrupt on STOP condition 
 * Register this callback with attachInterrupt(P1_7, usi_i2c_stop, RISING);
 * Once called check for USISTP in USICTL1 register.
 */
void usi_i2c_stop(void)
{
	if(!(USICTL1 & USISTP)) {
		return;
	}

	/* No need to monitor while we are idle */
	detachInterrupt(P1_7);
	/* Terminate the string if there is room */
	if(twi_rxBufferIndex < TWI_BUFFER_LENGTH){
		twi_rxBuffer[twi_rxBufferIndex] = '\0';
	}

	/* Callback the user with data received */
	twi_onSlaveReceive(twi_rxBuffer, twi_rxBufferIndex);
	twi_state = TWI_IDLE;
}

/* Slave transmitter:
 * START->PROC_ADDR->SEND_BYTE->SEND_BYTE->PREP_DATA_ACK->PROC_DATA_ACK->TWI_IDLE
						^-------------^
 */
__attribute__((interrupt(USI_VECTOR)))
void USI_ISR(void)
{
	if (!(USICTL0 & USIMST) && (USICTL1 &USISTTIFG)) {
		twi_state = TWI_SL_START;
	}
	
	switch(twi_state){
	// Master transmit / receive
	case TWI_SND_START:
		send_start();
		twi_state = TWI_PREP_SLA_ADDR_ACK;
		break;
	case TWI_PREP_SLA_ADDR_ACK: // reveive (N)ACK
		USICTL0 &= ~USIOE; // SDA = input
		USICNT |= 0x01; // Bit counter=1
		twi_state = TWI_MT_PROC_ADDR_ACK;
		break;
	case TWI_MT_PROC_ADDR_ACK:
		if (USISRL & 0x01) {
			twi_error = TWI_ERROR_ADDR_NACK;
			twi_stop();
			twi_state = TWI_EXIT;
			break;
		}
		if(twi_slarw & 1)
			goto mtre;
		else
			goto mtpd;
		// else fall through and process data ACK;
	case TWI_MT_PREP_DATA_ACK: // reveive (N)ACK
		USICTL0 &= ~USIOE; // SDA = input
		USICNT |= 0x01; // Bit counter=1
		twi_state = TWI_MT_PROC_DATA_ACK;
		break;
	case TWI_MT_PROC_DATA_ACK:
mtpd:
		if (USISRL & 0x01) {
			twi_error = TWI_ERROR_DATA_NACK;
			twi_stop();
			twi_state = TWI_EXIT;
			break;
		}

		if(twi_masterBufferIndex == twi_masterBufferLength) {
			twi_stop();
			twi_state = TWI_EXIT;
			break;
		}

		USICTL0 |= USIOE;
		USISRL = twi_masterBuffer[twi_masterBufferIndex++];
		USICNT |=  0x08;
		twi_state = TWI_MT_PREP_DATA_ACK;
		break;
	// Master receiver
mtre:
	case TWI_MR_PREP_DATA_RECV:
		USICTL0 &= ~USIOE; // SDA input
		USICNT |=  0x08; // Bit counter = 8, RX data
		twi_state = TWI_MR_PROC_DATA_RECV;
		break;
	case TWI_MR_PROC_DATA_RECV:
		USICTL0 |= USIOE; // SDA output
		twi_masterBuffer[twi_masterBufferIndex++] = USISRL;
		if(twi_masterBufferIndex > twi_masterBufferLength ) {
			USISRL = 0xFF; // that was the last byte send NACK
			twi_state = TWI_MR_PREP_STOP;
		} else {
			USISRL = 0x00; // keep on receiving and send ACK
			twi_state = TWI_MR_PREP_DATA_RECV;
		}
		USICNT |= 0x01;
		break;
	case TWI_MR_PREP_STOP:
		twi_stop();
		twi_state = TWI_EXIT;
		break;
	/* Slave receiver / transmitter. */
	
	/* START condition received */
	case TWI_SL_START:
		/* Work around for I2C no interrupt on STOP condition
		 * Register on start so that USI master will not suffer
		 * from this work around.*/
		attachInterrupt(P1_7, usi_i2c_stop, RISING);
		/* clear START interrupt flag */
		USICTL1 &= ~USISTTIFG;
		USICTL0 &= ~USIOE;
		/* bit counter to 8 */
		USICNT = (USICNT & 0xE0) + 0x08;
		twi_state = TWI_SL_PROC_ADDR;
		break;
	/* Process address */
	case TWI_SL_PROC_ADDR:
		/* Are we being addressed? */
		if (twi_my_addr == (USISRL & ~0x1)) {
			/* Read? */
			if (USISRL & 0x01) {
				// enter slave transmitter mode
				twi_txBufferIndex = 0;
				// set tx buffer length to be zero, to verify if user changes it
				twi_txBufferLength = 0;
				// request for txBuffer to be filled and length to be set
				// note: user must call twi_transmit(bytes, length) to do this
				twi_onSlaveTransmit();
				// if they didn't change buffer & length, initialize it
				if(0 == twi_txBufferLength){
					twi_txBufferLength = 1;
					twi_txBuffer[0] = 0x00;
				}
				twi_state = TWI_SL_SEND_BYTE;
			} else {
				twi_rxBufferIndex = 0;
				twi_state = TWI_SL_RECV_BYTE;
			}
			/* Send ACK */
			USISRL = 0x00;
		} else {
			/* Send NACK */
			USISRL = 0xFF;
			twi_state = TWI_EXIT;
		}
		/* SDA output */
		USICTL0 |= USIOE;
		/* Bit counter 1 */
		USICNT |= 1;
		break;
	/* Slave transmit */
	/* Transmit a byte */
	case TWI_SL_SEND_BYTE:
		goto sltr;
	/* Prepare to receive data (N)ACK */
	case TWI_SL_PREP_DATA_ACK:
		/* SDA input */
		USICTL0 &= ~USIOE;
		/* bit counter is 1 */
		USICNT |= 0x01;
		twi_state = TWI_SL_PROC_DATA_ACK;
		break;
	/* Process data (N)ACK */
	case TWI_SL_PROC_DATA_ACK:
		if (USISRL & 0x01) {
			/* NACK */
			/* Reset state machine */
			twi_state = TWI_EXIT;
			/* Immediately trigger another interrupt by return here
			 * and preventing USIIFG from being cleared. i
			 * This will make it hit the TWI_EXIT state on the next interrupt */
			return;
		} else {
sltr:
			/* If there is more to send, ack, otherwise nack */
			if(twi_txBufferIndex < twi_txBufferLength){
				/* Load transmit register */
				USISRL = twi_txBuffer[twi_txBufferIndex++];
				/* SDA output */
				USICTL0 |= USIOE;
				/* Bit counter is 8. */
				USICNT |=  0x08;
				twi_state = TWI_SL_PREP_DATA_ACK;
				break;
			}
			/* Going into exit state will effectively make SDA 1 until the next START 
			 * To the master this means reading FF for all bytes over the number queued. */
			twi_state = TWI_EXIT;
			/* Immediately trigger another interrupt by return here
			 * and preventing USIIFG from being cleared. i
			 * This will make it hit the TWI_EXIT state on the next interrupt */
			return;
		}
		break;
	/* Slave receive */
	case TWI_SL_RECV_BYTE:
		/* SDA input */
		USICTL0 &= ~USIOE;
		/* Bit counter is 8. */
		USICNT |=  0x08;
		twi_state = TWI_SL_PROC_BYTE;
		break;
	case TWI_SL_PROC_BYTE:
		if(twi_rxBufferIndex < TWI_BUFFER_LENGTH){
			// put byte in buffer and ack
			twi_rxBuffer[twi_rxBufferIndex++] = USISRL;
			USISRL = 0x00;
			twi_state = TWI_SL_RECV_BYTE;
		} else {
			// otherwise nack
			USISRL = 0xFF;
			twi_state = TWI_EXIT;
		}
		USICTL0 |= USIOE;
		USICNT |= 0x01;
		break;
	/* All */
	case TWI_EXIT:
		/* Load FF into output shift register */
		USISRL = 0x0FF;
		/* Output latch transparant. MSB of USISR to the SDO pin. */
		USICTL0 |= USIGE;
		/* Latch disabled and make SDA input */
		USICTL0 &= ~(USIGE+USIOE);
		twi_state = TWI_IDLE; //Idle
		break;
	case TWI_IDLE:
                break; //Nothing to do fall thru and clear interrupt flag.

	default:
		break;// Should not happen.
	}

